In [52]:
%pip install pandas sqlalchemy pyodbc

Requirement already satisfied: pandas in c:\users\iheb\appdata\local\programs\python\python312\lib\site-packages (2.2.2)
Requirement already satisfied: sqlalchemy in c:\users\iheb\appdata\local\programs\python\python312\lib\site-packages (2.0.31)
Requirement already satisfied: pyodbc in c:\users\iheb\appdata\local\programs\python\python312\lib\site-packages (5.1.0)
Requirement already satisfied: numpy>=1.26.0 in c:\users\iheb\appdata\local\programs\python\python312\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\iheb\appdata\roaming\python\python312\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\iheb\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\iheb\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\iheb\appdata\local\programs\python\python312\lib\site-packages (from sqlalchemy) (4.12.2)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\iheb\appdata\local\programs\python\python312\lib\site-packages (from sqlalchemy) (3.0.3)
Requirement already satisfied: six>=1.5 in c:\users\iheb\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [53]:
import json
import pandas as pd
from sqlalchemy import create_engine
import warnings
import os
%time

CPU times: total: 0 ns
Wall time: 0 ns

In [54]:
%time
warnings.filterwarnings('ignore')
# Load configuration from JSON file
with open('C:/Users/Iheb/Desktop/Cours/Projects/Vesitaire_use_case/conf.json', 'r') as config_file:
    config = json.load(config_file)

# Fetching credentials from the configuration
server = config['server']
database = config['database']
username = config['username']
password = config['password']
driver = config['driver']

# Create a database connection string
connection_string = f"mssql+pyodbc://{username}:{password}@{server}/{database}?driver={driver}&TrustServerCertificate=yes"

# Create a SQLAlchemy engine
engine = create_engine(connection_string)

# Executing query 1
sales = 'SELECT * FROM [Testing].[dbo].[sales_vestiaire]'

# Execute the query and load data into a pandas DataFrame
sales_vestiaire = pd.read_sql(sales, engine)

#Executing query 2
country = 'SELECT * FROM [Testing].[dbo].[country]'

# Execute the query and load data into a pandas DataFrame
country = pd.read_sql(country, engine)

CPU times: total: 0 ns
Wall time: 0 ns

Voir les premières lignes de chaque table dans notre Base de données

In [55]:
print(sales_vestiaire.head())
print('\n')
print(country.head())

   ID_ORDER  ID_PRODUCT  ID_BUYER  ID_SELLER  ID_SELLER_COUNTRY  \
0  34033734    13681706   9666775    6723223                203
1  33933770    13575555   8259842    9983902                222
2  33415990    10239167   8541994     144764                141
3  33415990    10239167   8941774     144764                141
4  33415990    10239167   8541774     944764                141

   ID_BUYER_COUNTRY        DATE_PAYMENT      BRAND  CATEGORY     REVENUE
0               170 2021-01-07 00:09:24  Dsquared2  clothing   57.274559
1               222 2021-01-05 00:23:10      Eytys     shoes  168.739868
2               204 2021-01-06 00:06:50       Dior     shoes  126.414001
3               204 2021-01-06 00:06:50       Dior     shoes  126.414001
4               204 2021-01-06 00:06:50       Dior     shoes  126.414001


   ID_COUNTRY   REGION         COUNTRY
0           0  UNKNOWN         UNKNOWN
1           1     EMEA     Afghanistan
2           2     EMEA         Albania
3           3     EMEA         Algeria
4           4     APAC  American Samoa

Creation d'une fonction qui exécute une requête SQL contenue dans queries et retourne le résultat sous le format d'une dataframe

In [56]:
def execute_query(query_file, engine, **kwargs):
    try:
        query_path = os.path.join('C:/Users/Iheb/Desktop/Cours/Projects/Vesitaire_use_case/queries', query_file)
        with open(query_path, 'r') as sql_file:
            query = sql_file.read()
            df = pd.read_sql(query, engine, **kwargs)
            print(f"Query {query_file} executed successfully\n")
            return df  # Return DataFrame if needed for further processing
    except Exception as e:
        print(f"Error executing query from {query_file}: {str(e)}\n")

Top 10 Brands

In [57]:
execute_query('Q1.sql', engine)

Query Q1.sql executed successfully

                  BRAND   Tot_revenue
0                Chanel  67121.056709
1                 Gucci  50919.974384
2                Hermès  42004.112427
3         Louis Vuitton  40947.424335
4                  Dior  14767.671007
5                 Prada  14588.179955
6       Dolce & Gabbana  12011.271271
7         Saint Laurent   7774.730789
8            Balenciaga   7746.351032
9  Non Signé / Unsigned   7688.520052

La contribution (en percentage) de chaque pays du total des ventes et des éléments vendus

In [58]:
execute_query('Q2.sql',engine)

Query Q2.sql executed successfully

,country,contribition_sales_country,contribution_nbItems_sold_country
0,Italy,25.871220,31.490223
1,France,23.230023,19.285233
2,United Kingdom,11.401872,13.351315
3,United States,6.467519,4.180715
4,Germany,6.449867,6.068780
5,Spain,5.042490,5.124747
6,Hong Kong,2.418840,1.483479
7,United Arab Emirates,2.118018,0.809171
8,Netherlands,2.034460,2.225219
9,Ireland,1.415533,0.809171
10,Sweden,1.379567,1.213756
11,Austria,1.374226,1.078894
12,Bulgaria,1.274548,1.146325
13,Belgium,1.118906,1.348618
14,Poland,0.914872,1.146325
15,Singapore,0.877446,0.269724
16,Romania,0.874848,1.213756
17,Monaco,0.693169,0.472016
18,Luxembourg,0.569499,0.404585
19,Latvia,0.447418,0.539447
20,Greece,0.434614,1.078894
21,Lithuania,0.422741,0.337154
22,Portugal,0.348602,0.944032
23,Czech Republic,0.324117,0.269724
24,Australia,0.303791,0.674309
25,Canada,0.291007,0.134862
26,Croatia,0.274770,0.404585
27,Japan,0.231311,0.202293
28,Russia,0.225304,0.067431
29,Hungary,0.200139,0.337154
30,Denmark,0.192264,0.606878
31,Switzerland,0.171166,0.202293
32,Canary Islands,0.134340,0.067431
33,Malta,0.092799,0.067431
34,Cyprus,0.062949,0.202293
35,China,0.061622,0.067431
36,Thailand,0.059760,0.067431
37,Slovenia,0.048954,0.269724
38,Estonia,0.048464,0.067431
39,Slovakia,0.039970,0.134862
40,Turkey,0.032000,0.067431
41,Finland,0.024974,0.067431

Les meilleurs relations entre le pays en terme de revenue

In [59]:
execute_query('Q3.sql',engine)

Query Q3.sql executed successfully

           country1        country2  revenue_generated_countries
0            France           Italy                 40073.301579
1    United Kingdom  United Kingdom                 28410.955477
2            France          France                 26187.009915
3     United States   United States                 20767.800240
4             Italy           Italy                 17485.696054
..              ...             ...                          ...
247         Estonia         Romania                    20.700001
248         Croatia     Netherlands                    20.700001
249          Cyprus           Italy                    18.000000
250         Hungary           Italy                    16.200001
251          Latvia          Sweden                    13.837500

[252 rows x 3 columns]

Le pourcentage des acheteurs qui ont acheté la 2éme semaine et qui ont acheté eux aussi la 1ère semaine

In [60]:
execute_query('Q5.sql',engine)

Query Q5.sql executed successfully

   pourcentage_w2_w1_buyers
0                      0.35

Le revenue total des acheteurs répétitifs de la 1ere et deuxieme semaine (in % increase or decrease)

In [61]:
execute_query('Q6.sql',engine)

Query Q6.sql executed successfully

   revenue_w1   revenue_w2 inc_or_dec_percentage
0  713.015991  1018.116028       42.79 %increase
1   35.274330    69.690239       97.57 %increase
2   23.400000    20.700001      -11.54 %decrease
3  231.745407   139.844620      -39.66 %decrease
4   56.700001    67.500000       19.05 %increase
5  816.011353  2210.373047      170.88 %increase